<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
  <head>
    <meta http-equiv="content-type" content="text/html;
      charset=ISO-8859-1">
    <title>PPM Help</title>
    <link href="../../share/doc/manual.css" rel="stylesheet" type="text/css" />
  
  </head>
  <body>

  <div id="container">
   <div id="main">
    <br>
    <table style="text-align: left; width: 700px; margin-left: auto;
      margin-right: auto;" border="0" cellpadding="2" cellspacing="2">
      <tbody>
        <tr>
          <td style="vertical-align: top;">
            <h1>Gestionnaire des paquets (PPM) </h1>
            "Paquet" est le terme Linux pour d&eacute;signer une
            application. Ces paquets sont gard&eacute;s en ligne, dans
            des d&eacute;p&ocirc;ts, et vous pouvez
            t&eacute;l&eacute;charger et installer n'importe quel
            paquet.<br>
            <h2>Comment les installer</h2>
            Cliquez sur un bouton radio tout en haut pour choisir le
            d&eacute;p&ocirc;t d&eacute;sir&eacute;.
            G&eacute;n&eacute;ralement le plus &agrave; gauche est le
            plus appropri&eacute; &agrave; votre version de
            Puppy/Toutou.<br>
            <br>
            Les boutons radio align&eacute;s verticalement sur la gauche
            vous permettent de restreindre l'affichage &agrave; une
            cat&eacute;gorie sp&eacute;cifique.<br>
            <br>
            Remarque sur les case &agrave; cocher EXE, DEV, DOC et NLS.
            Beaucoup de paquets PET sont divis&eacute;s en petits
            paquets :<br>
            <br>
            EXE: C'est l'application en elle-m&ecirc;me, vous en avez
            absolument besoin (ne pas confondre avec les fichiers .exe
            de Windows).<br>
            DEV: Contient des fichiers de d&eacute;veloppement. N'a
            d'int&eacute;r&ecirc;t que pour la compilation du code
            source .<br>
            DOC: Contient les fichiers de documentation de l'ensemble.<br>
            NLS: Contient les fichiers de langue du paquet.<br>
            <br>
            Notez que tous les paquets (si vous installez uniquement le
            paquet "EXE")
            sont en anglais. Le paquet NLS ajoutera la prise en charge
            d'autres langues,
            mais cela varie consid&eacute;rablement d'un paquet &agrave;
            l'autre. Certains paquets ne
            prennent pas en charge d'autre langue que l'anglais.<br>
            <br>
            Les paquets PET suivent la convention d'appellation suivante
            :<br>
            <br>
            <div style="margin-left: 40px;">
              abiword-1.2.3.pet ("EXE" package)<br>
              abiword_DEV-1.2.3.pet<br>
              abiword_DOC-1.2.3.pet<br>
              abiword_NLS-1.2.3.pet<br>
            </div>
            <br>
            Malheureusement tous les auteurs de paquets PET ne suivent
            pas la pratique de fractionnement des paquets PET. Dans
            certains cas ce peut &ecirc;tre, par exemple,
            "abiword-1.2.3.pet" avec tous les &eacute;l&eacute;ments
            ("EXE", DEV, DOC, NLS). La raison de
            la division est de r&eacute;duire la taille des paquets EXE.<br>
            <br>
            Lorsque vous cliquez sur un des paquets affich&eacute;s dans
            la grande fen&ecirc;tre,
            une autre fen&ecirc;tre s'ouvre pour vous demander de
            confirmer que vous voulez vraiment installer le paquet, et
            propose &eacute;galement de plus amples informations sur ce
            paquet. Ainsi vous pouvez en apprendre davantage avant de
            d&eacute;cider de l'installer.<br>
            <h2>Comment d&eacute;sinstaller</h2>
            Quand un paquet est install&eacute;, il appara&icirc;t dans
            la fen&ecirc;tre du bas.<br>
            Pour d&eacute;sinstaller un paquet, il vous suffit de
            cliquer dessus. Une fen&ecirc;tre apparaitra pour vous
            demander de confirmer la suppression.<br>
            <h2>D&eacute;pots PET</h2>
            Il existe diff&eacute;rents d&eacute;pots de paquets PET.
            Ceux propos&eacute;s d&eacute;pendront de la version
            de Puppy/Toutou que vous utilisez, mais en
            g&eacute;n&eacute;ral il y aura au moins un de
            ceux-l&agrave;:<br>
            <br>
            <div style="margin-left: 40px;">
              puppy-2: La tr&egrave;s vielle s&eacute;rie de Puppy 2.x<br>
              puppy-3: La s&eacute;rie de Puppy 3.x<br>
              puppy-4: La s&eacute;rie de Puppy 4.x<br>
              puppy-5: La s&eacute;rie de Puppy 5.x<br>
            </div>
            <br>
            Pour votre Puppy/Toutou, vous pouvez &eacute;galement en
            avoir d'autres, comme 'puppy-quirky', 'puppy-wary5', ou
            'puppy-lucid'.<br>
            <br>
            En r&egrave;gle g&eacute;n&eacute;rale, utilisez ceux qui
            semblent les plus appropri&eacute;es &agrave; votre version
            de Puppy/Toutou. Les plus anciens ont des paquets qui
            peuvent ou pas fonctionner
            pour votre version. Plus le d&eacute;pot sera ancien plus ce
            sera le cas. <br>
            <br>
            Nous gardons les anciens d&eacute;p&ocirc;ts disponibles,
            parce qu'il arrive parfois que vous souhaitez utiliser
            certains vieux paquets. Mais en r&egrave;gle
            g&eacute;n&eacute;rale, cherchez dans les
            d&eacute;p&ocirc;ts les plus r&eacute;cents en premier.<br>
            <br>
            Votre version de Puppy/Toutou peut &ecirc;tre construite
            &agrave; partir des paquets de l'une des autres grandes
            distributions Linux, comme Debian, Ubuntu ou Slackware. Dans
            ce cas,
            PPM offrira ces d&eacute;pots. Ils seront les plus
            compatibles et ceux que vous devrez rechercher en premier.<br>
            <br>
            Bien s&ucirc;r, les paquets des autres distributions ne sont
            pas des paquets PET. Les paquets PET poss&egrave;dent le
            suffixe .pet (extension du fichier).<br>
            Debian et Ubuntu ont des paquets DEB, avec le suffixe
            ".deb".<br>
            Les paquets Slackware ont comme suffixe ".tgz" ou ".txz".<br>
            Quel que soit le type de paquet, PPM est capable de
            l'installer.<br>
            <br>
            <h2>
              Recherche</h2>
            La boite "Rech." vous permet de rechercher n'importe quel
            fichier, mais notez qu'il ne recherche que dans le
            d&eacute;pot s&eacute;lectionn&eacute;.<br>
            <br>
            Vous pouvez taper un nom partiel, mais la correpondance
            n'est trouv&eacute;e que de la gauche. Par exemple, si vous
            effectuez une recherche pour "pan" vous allez trouver ceci :<br>
            <br>
            <div style="margin-left: 40px;">pango-1.28.1-w5 Library for
              layout and rendering of internationalized text<br>
              pango_DOC-1.28.1-w5 Library for layout and rendering of
              internationalized text<br>
              pangomm-2.26.2-w5 oo wrapper for pango library<br>
              pangomm_DOC-2.26.2-w5 oo wrapper for pango library<br>
              panoramixproto-1.1-w5 Panoramix extension headers<br>
            </div>
            <br>
            Mais faire une recherche sur "mm" ne donnera rien, parce
            qu'il n'y a pas de nom de paquet commen&ccedil;ant par "mm".<br>
            <br>
            Cependant, la bo&icirc;te de recherche acceptera les jokers
            '*', que nous appelons les "Jokers globaux". Donc, taper "*
            mm&raquo; permettra de trouver tous les paquets avec "mm"
            dans le nom.<br>
            <br>
            Vous pouvez m&ecirc;me avoir des jokers multiples, par
            exemple "p*mix*to", trouvera le paquet 'panoramixproto'.<br>
            <br>
            La recherche est insensible &agrave; la casse, ainsi une
            recherche pour "PAN" donnera les m&ecirc;mes
            r&eacute;sultats que plus haut.<br>
            <br>
            Autre chose &agrave; noter, la recherche est
            effectu&eacute;e dans la totalit&eacute; du d&eacute;pot, et
            ignore les boutons radio des cat&eacute;gories sur le
            cot&eacute; gauche.<br>
            <br>
            <h2>Installation sans l'interface graphique PPM</h2>
            Vous pouvez actuellement t&eacute;l&eacute;charger n'importe
            quel paquet de n'importe o&ugrave; et l'installer. Tout ce
            que vous avez &agrave; faire est de cliquer sur le paquet
            dans la fen&ecirc;tre du gestionnaire de fichiers, et la
            composante de l'installateur de paquet de PPM
            s'ex&eacute;cutera et installera le paquet. Cela fonctionne
            pour de nombreux types de paquets, y compris les PET,
            Ubuntu/Debian DEB et les paquets Slackware et Arch.<br>
            <br>
            Notez toutefois, si vous installez un paquet individuel de
            cette fa&ccedil;on, sans passer par l'interface graphique
            PPM, toutes les d&eacute;pendances ne seront pas&nbsp;
            forc&eacute;ment install&eacute;es, et vous devrez vous en
            assurer vous-m&ecirc;me.<br>
            <br>
            Une bonne chose, un paquet install&eacute; de cette
            mani&egrave;re sera affich&eacute; dans la fen&ecirc;tre des
            paquets install&eacute;s de l'interface graphique PPM et il
            pourra donc &ecirc;tre d&eacute;sinstall&eacute;.<br>
            <br>
            Cordialement,<br>
            Barry Kauler, Dec. 2010</td>
        </tr>
      </tbody>
    </table>
    <br>
  	</div> <!--main-->
 </body>
</html>
