Repository: puppylinux-woof-CE/woof-CE
Catalog: woof-code/rootfs-petbuilds/netmon_wce/netmon_wce-3.3/po/*.po
Languages: de, es, fr, it, zh_cn, zh_hk

source: Active interface:
de: Aktive Schnittstelle:
es: Interfaz activa:
fr: Interface active :
it: Scheda di rete attiva:
zh_cn: 活跃的介面
zh_hk: 活躍的介面

source: Click this icon for network setup
de: Klick für Netzwerk-Einrichtung
es: Clic en éste ícono para configurar la red
fr: Cliquez sur cette icône pour configurer le réseau
it: Seleziona l'icona per impostare la rete
zh_cn: 滑鼠左击图标以设定网络
zh_hk: 滑鼠左擊圖標以設定網絡

source: Disable wireless device polling
de: Polling für Drahtlos-Geräte deaktivieren
es: Sondeo de dispositivo inalámbrico deshabilitado
fr: Désactiver le sondage du dispositif sans fil
it: Disabilita scheda wireless
zh_cn: 关闭无线网络轮流检测功能
zh_hk: 關閉無線網絡輪流檢測功能

source: Disconnect from network
de: Vom Netzwerk trennen
es: Desconectar de la red
fr: Déconnecter le réseau
it: Disconnessione dalla rete
zh_cn: 解除网络连线
zh_hk: 解除網絡連線

source: Enable wireless device polling
de: Polling für Drahtlos-Geräte aktivieren
es: Sondeo de dispositivo inalámbrico habilitado
fr: Activer le sondage du dispositif sans fil
it: Abilita scheda wireless
zh_cn: 开启无线网络轮流检测功能
zh_hk: 開啟無線網絡輪流檢測功能

source: IP address:
de: IP-Adresse:
es: Dirección IP:
fr: Adresse IP :
it: Indirizzo IP:
zh_cn: IP 地址
zh_hk: IP 地址

source: Month
de: Monat
es: Mes
fr: Mois
it: Mese
zh_cn: 月
zh_hk: 月

source: Network status information
de: Netzwerkstatus-Information
es: Información de estado de la red
fr: Etat du réseau
it: Stato della rete
zh_cn: 网络状态资讯
zh_hk: 網絡狀態資訊

source: No active network interfaces
de: keine aktiven Netzwerk-Schnittstellen
es: No hay interfaces de redes activas
fr: Aucune interface réseau active
it: Nessuna scheda di rete attiva
zh_cn: 无活跃的网络介面
zh_hk: 無活躍的網絡介面

source: Note: right-click icon for network menu
de: Hinweis: Rechts-Klick bringt Netzwerk-Menü
es: Nota: clic derecho en el ícono para el menú de red
fr: Un clic-droit affiche le menu réseau
it: Nota: click mouse destro per il menu della rete
zh_cn: 注：滑鼠右击图标显示网络菜单
zh_hk: 註：滑鼠右擊圖標顯示網絡菜單

source: Quit
de: Beenden
es: Salir
fr: Quitter
it: Esci
zh_cn: 退出
zh_hk: 退出

source: Reconnect to network
de: Ins Netzwerk wiederverbinden
es: Reconectar a la red
fr: Reconnecter le réseau
it: Connessione alla rete
zh_cn: 重试网络连线
zh_hk: 重試網絡連線

source: Setup networking
de: Netzwerk einrichten
es: Configurar red
fr: Configurer le réseau
it: Impostazioni rete
zh_cn: 设定网络
zh_hk: 設定網絡

source: Wifi Stats unreadable - disable polling in the menu.
de: Statistik nicht lesbar - 'polling' im Menü deaktivieren.
es: Estadísticas de red wi-fi ilegibles - desactive sondeo en el menú.
fr: Statistiques sans fil illisibles (il est possible de désactiver le sondage dans le menu).
it: Statistiche WiFi non leggibili - disattiva interrogazione nel menu.
zh_cn: Wifi 状态无法读取 - 在菜单上关闭轮流检测功能
zh_hk: Wifi 狀態無法讀取 - 在菜單上關閉輪流檢測功能

source: Wifi stats disabled
de: Statistik deaktiviert
es: Estadísticas de red wi-fi desactivadas
fr: Statistiques sans fil désactivées
it: Statistiche WiFi non attive
zh_cn: Wifi 状态关上
zh_hk: Wifi 狀態關上

source: Wireless Strength
de: Drahtlos-Signalstärke
es: Fuerza de la señal
fr: Puissance du signal sans fil
it: Potenza segnale wireless
zh_cn: 无线讯号强度
zh_hk: 無線訊號強度

source: none
de: keine
es: ninguna
fr: rien
it: nessuna
zh_cn: 无
zh_hk: 無
